<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="1,80,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>1</dim>
					<dim>80</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="fc.3.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="7" offset="0" size="14" />
			<output>
				<port id="0" precision="FP16" names="fc.3.bias">
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="fc.3.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="fc.0.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128" offset="14" size="256" />
			<output>
				<port id="0" precision="FP16" names="fc.0.bias">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="fc.0.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_1037" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="270" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/lstm/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/lstm/Transpose_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_1064" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="294" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Transpose_1065" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_1032_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="318" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="10" name="Constant_1032" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="11" name="/lstm/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="320" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/lstm/Constant_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_1020" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="328" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Transpose_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/lstm/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/lstm/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/lstm/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="352" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/lstm/Constant_output_0" />
			</output>
		</layer>
		<layer id="16" name="Constant_1024" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="352" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="17" name="/lstm/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/lstm/Gather_output_0" />
			</output>
		</layer>
		<layer id="18" name="Constant_23" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="352" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_29">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/lstm/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/lstm/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/lstm/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="360" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/lstm/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/lstm/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/lstm/Concat_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/lstm/ConstantOfShape" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/lstm/ConstantOfShape_output_0">
					<dim>4</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/lstm/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="352" size="8" />
			<output>
				<port id="0" precision="I64" names="/lstm/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/lstm/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="368" size="8" />
			<output>
				<port id="0" precision="I64" names="/lstm/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_1042" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="376" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="ShapeOf_1043" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Broadcast_1044" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/lstm/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="352" size="8" />
			<output>
				<port id="0" precision="I64" names="/lstm/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/lstm/Slice" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/lstm/Slice_output_0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_1093" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="294" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Transpose_1094" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/lstm/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="352" size="8" />
			<output>
				<port id="0" precision="I64" names="/lstm/Constant_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/lstm/Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="368" size="8" />
			<output>
				<port id="0" precision="I64" names="/lstm/Constant_8_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_1054" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="376" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="ShapeOf_1055" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Broadcast_1056" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/lstm/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="352" size="8" />
			<output>
				<port id="0" precision="I64" names="/lstm/Constant_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/lstm/Slice_1" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/lstm/Slice_1_output_0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_1095" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="294" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Transpose_1096" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="ShapeOf_1072" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_1076" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="384" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_1073" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="388" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Gather_1077" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_1074" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="388" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Gather_1075" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Broadcast_1089" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="onnx::LSTM_358_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 1024, 80" offset="392" size="327680" />
			<output>
				<port id="0" precision="FP16" names="onnx::LSTM_358">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="onnx::LSTM_358" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_1066" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="376" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="51" name="Split_1067" type="Split" version="opset1">
			<data num_splits="4" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>80</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>80</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>80</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Concat_1068" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>80</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>80</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="onnx::LSTM_359_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 1024, 256" offset="328072" size="1048576" />
			<output>
				<port id="0" precision="FP16" names="onnx::LSTM_359">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="onnx::LSTM_359" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_1069" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="376" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="56" name="Split_1070" type="Split" version="opset1">
			<data num_splits="4" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Concat_1071" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="onnx::LSTM_357_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 2048" offset="1376648" size="8192" />
			<output>
				<port id="0" precision="FP16" names="onnx::LSTM_357">
					<dim>2</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="onnx::LSTM_357" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_1083" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="376" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="61" name="Split_1084" type="Split" version="opset1">
			<data num_splits="2" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Add_1085" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_1086" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="376" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="64" name="Split_1087" type="Split" version="opset1">
			<data num_splits="4" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Concat_1088" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="LSTMSequence_1105" type="LSTMSequence" version="opset5">
			<data direction="bidirectional" hidden_size="256" activations="sigmoid, tanh, tanh" activations_alpha="" activations_beta="" clip="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>80</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
				<port id="6" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="8" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="9" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_1106" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1384840" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/lstm/LSTM_/lstm/LSTM_output_0" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/lstm/LSTM_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_1112" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1384872" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/lstm/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/lstm/Transpose_1_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/lstm/Constant_9" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1384904" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/lstm/Constant_9_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/lstm/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/lstm/Reshape_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_1141" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="294" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Transpose_1142" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/lstm/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="368" size="8" />
			<output>
				<port id="0" precision="I64" names="/lstm/Constant_11_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/lstm/Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="320" size="8" />
			<output>
				<port id="0" precision="I64" names="/lstm/Constant_12_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_1119" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="376" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="ShapeOf_1120" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Broadcast_1121" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/lstm/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="352" size="8" />
			<output>
				<port id="0" precision="I64" names="/lstm/Constant_10_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/lstm/Slice_2" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/lstm/Slice_2_output_0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_1170" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="294" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Transpose_1171" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/lstm/Constant_14" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="368" size="8" />
			<output>
				<port id="0" precision="I64" names="/lstm/Constant_14_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/lstm/Constant_15" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="320" size="8" />
			<output>
				<port id="0" precision="I64" names="/lstm/Constant_15_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_1131" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="376" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="ShapeOf_1132" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Broadcast_1133" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/lstm/Constant_13" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="352" size="8" />
			<output>
				<port id="0" precision="I64" names="/lstm/Constant_13_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/lstm/Slice_3" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/lstm/Slice_3_output_0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_1172" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="294" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Transpose_1173" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="ShapeOf_1149" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_1153" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="384" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_1150" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="388" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Gather_1154" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_1151" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="388" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Gather_1152" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Broadcast_1166" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="onnx::LSTM_401_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 1024, 512" offset="1384928" size="2097152" />
			<output>
				<port id="0" precision="FP16" names="onnx::LSTM_401">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="onnx::LSTM_401" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_1143" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="376" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="103" name="Split_1144" type="Split" version="opset1">
			<data num_splits="4" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Concat_1145" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="onnx::LSTM_402_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 1024, 256" offset="3482080" size="1048576" />
			<output>
				<port id="0" precision="FP16" names="onnx::LSTM_402">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="onnx::LSTM_402" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Constant_1146" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="376" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="108" name="Split_1147" type="Split" version="opset1">
			<data num_splits="4" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Concat_1148" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="onnx::LSTM_400_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 2048" offset="4530656" size="8192" />
			<output>
				<port id="0" precision="FP16" names="onnx::LSTM_400">
					<dim>2</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="onnx::LSTM_400" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_1160" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="376" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="113" name="Split_1161" type="Split" version="opset1">
			<data num_splits="2" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Add_1162" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_1163" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="376" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="116" name="Split_1164" type="Split" version="opset1">
			<data num_splits="4" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Concat_1165" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="LSTMSequence_1182" type="LSTMSequence" version="opset5">
			<data direction="bidirectional" hidden_size="256" activations="sigmoid, tanh, tanh" activations_alpha="" activations_beta="" clip="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>512</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
				<port id="6" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="8" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="9" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Constant_1183" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1384840" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="/lstm/LSTM_1_/lstm/LSTM_1_output_0" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/lstm/LSTM_1_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Constant_1189" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1384872" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="/lstm/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/lstm/Transpose_2_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="/lstm/Constant_16" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1384904" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/lstm/Constant_16_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="/lstm/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/lstm/Reshape_1_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Constant_1193" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="294" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="/lstm/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/lstm/Transpose_3_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="onnx::MatMul_403_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 128" offset="4538848" size="131072" />
			<output>
				<port id="0" precision="FP16" names="onnx::MatMul_403">
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="onnx::MatMul_403" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="/fc/fc.0/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/fc/fc.0/MatMul_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="/fc/fc.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/fc/fc.0/Add_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
